CS132-F23/policies.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-14 Tue 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="courseStyle.css">
</head>
<body>
<div id="org-div-home-and-up">⟨ <a href="index.html">home</a> ⟩</div><div id="content" class="content">
<p>
+title: Course Policies
</p>
<p>
There are a number of university policices and course guidelines you
should be aware of. <i>Read them carefully and completely.</i> Also keep in
mind that, though I am required to use specific language in some
cases, I stand behind these policies sincerely and seriously, and I
hope you feel comfortable reaching out to me about any of them if you
need to. See the <a href="https://www.bu.edu/policies/">BU Policies</a> page for a complete collection of
university's policies.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
<div id="outline-container-org8836684" class="outline-2">
<h2 id="org8836684">Academic Integrity</h2>
<div class="outline-text-2" id="text-org8836684">
<p>
Please read the BU's <a href="https://www.bu.edu/academics/policies/academic-conduct-code/">academic conduct code</a>. This is taken very
seriously at BU and I take it seriously in the courses I teach.
</p>

<p>
I encourage students to work and study in groups, it's a useful way to
learn, but when you write down your solutions to an assignment, you
should do it from your own memory, without looking at anyone's work.
It is just as important that you <i>never</i> let anyone use your work. All
parties are culpable in cases of academic misconduct.
</p>

<p>
If you work with others, consult materials found on the internet, or
use an AI assistant, you should cite your sources.  This is a useful
skill in any setting, and so I recommend being as conservative as
possible regarding what you cite.  In any assignment, these <code>citations
should appear at the top of the submission</code> (in comments if the
submission is code). Some examples:
</p>

<ul class="org-ul">
<li>I discussed problem 1 and 2 with Leah Smith. She helped me understand X
and Y aspects of the problem.</li>
<li>I saw the stack overflow post
<i>stackoverflow.com/questions/6681284/python-numpy-arrays</i> which
informed my solution.</li>
<li>I helped Zihan Guo with problem 4. I told them to try using X.</li>
<li>I asked chatGPT "what's the largest eigenvalue of this matrix?" but
asked it not to show me how to solve for it.</li>
</ul>

<p>
Of course, it can be tricky determining when a citation is
necessary. Again, when in doubt, err on the side of longer, more
descriptive citations. And again, <code>all parties are
culpable</code>. Those who share their
work with others (this includes sending files and screen sharing)
receive the same attention as those who use that work. Please email me
immediately if you are unsure about a particular situation.
</p>

<p>
The line between collaboration, abuse of online resources, and
misconduct has become incredibly blurry, and cases are becoming more
difficult to navigate. There are obvious prohibitions:
</p>

<ul class="org-ul">
<li>Don't share your solutions with anyone else</li>
<li>Don't use the solutions of other students</li>
<li>Don't ask homework questions online on sites like Stack Overflow</li>
<li>Don't ask an AI assistant for a solution to a homework question</li>
<li>Don't consult a solution posted online, even if only to verify your own</li>
</ul>

<p>
It would be naive of me to believe that these things never happen, or
that I can recognize every case that it happens. But I have to depend
on the integrity of all of you, which also means that I have to take
seriously cases of academic misconduct if they do unfortunately come
up. Use your best judgment and remember:
</p>

<ul class="org-ul">
<li>I and the course staff care about your success in this course. We
provide a number of avenues to ask for help, please use them</li>
<li>You will have to answer questions on exams, without external aids</li>
<li>If you don't know how to start thinking about a problem, <code>it's okay
  to ask for pointers on how to start</code> in office hours and Piazza. We
can't give you any of the answer, but we may be able to put you in
the right direction</li>
<li>We build in safe-guards (like dropped homework assignments) in the
case you are unable to complete an assignment</li>
</ul>
</div>
</div>

<div id="outline-container-orgd05d80b" class="outline-2">
<h2 id="orgd05d80b">Disability Statement</h2>
<div class="outline-text-2" id="text-orgd05d80b">
<p>
If you require disability accomodations, please contact me as soon as
possible. You should provide me with the appropriate documentation,
available though BU's <a href="https://www.bu.edu/disability/">Disability and Access Services</a>.  If there's a
policy you see that I'm failing to comply with, please reach out with
suggestions. And if you'd like accomodations that are not covered by
existing services or policies, feel free to contact me and we can see
what we can do. I want everyone to feel able to fully participate in
the course.
</p>
</div>
</div>

<div id="outline-container-org35edd36" class="outline-2">
<h2 id="org35edd36">Diversity Statement</h2>
<div class="outline-text-2" id="text-org35edd36">
<p>
My aim is to present material in a way that respects the diversity of
the student body. If I fail to do this, please make me aware. Any
suggestions are welcomed and appreciated. I also expect students
taking any course of mine to appreciate and respect the unique
opportunity they have to participate in a diverse student body.
</p>
</div>
</div>

<div id="outline-container-org58d18e7" class="outline-2">
<h2 id="org58d18e7">Sexual Misconduct</h2>
<div class="outline-text-2" id="text-org58d18e7">
<p>
Please read BU's <a href="https://www.bu.edu/policies/sexual-misconduct-title-ix-hr/">Sexual Misconduct Policy</a> and review the entire page
for information about talking to someone confidentially about
experiences of sexual misconduct, filing a report, and any other
relevant information. Above all, you should feel safe, and able to be
productive. If this is not the case, please reach out to me or someone
else immediately.
</p>

<p>
The university is legally obligated to investigate reports of sexual
misconduct, and therefore it cannot guarantee the confidentiality of a
report, but it will consider a request for confidentiality and respect
it to the extent possible. I am also required to report incidents of
sexual misconduct and <code>cannot guarantee confidentiality</code>. I must provide
our Title IX coordinator with relevant details such as the names of
those involved in the incident.
</p>
</div>
</div>

<div id="outline-container-org73e642e" class="outline-2">
<h2 id="org73e642e">A Comment on Generative AI</h2>
<div class="outline-text-2" id="text-org73e642e">
<p>
We're going to be talking about the role of AI assistants in education
for the next decade, and the truth is that no one knows at this moment
what we're going to do about it. You are the first generation that
this is impacting, and not just in college, but likely when you leave
as well.
</p>

<p>
This can be a good thing. You have the ability to shape your
relationship with these tools (even if that means you choose not to
use them, or even to fight against their use). But as this is
happening, we still need to run courses at universities.
</p>

<p>
It would be drastic for me to prohibit the use of AI assistants, but
they <code>should not be used to solve homework assignments directly</code>. I've seen some
very powerful and creative ways that they have been used to aid
learning. Some ideas:
</p>

<ul class="org-ul">
<li>Ask explicitly for the solution not to be given</li>
<li>Ask about high-level ideas, like analogies or mnemonics</li>
<li>Ask for explanations about how code works, or why a piece of code is not working</li>
</ul>

<p>
If you have any other suggestions please let me know. The point is,
it's possible to use these tools in productive ways. Remember, <code>they're
not perfect</code>, they can be wrong, it can sometimes be easy to tell when
a solution was produced by an AI assistant, and you won't have access
to them in exams.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">This page is based on a syllabus for CAS
CS 132 provided to me by Mark Crovella, and on the syllabus of
<a href="https://www.classes.cs.uchicago.edu/archive/2023/summer/19911-1/info.html">CMSC 19911</a> by Ravi Chugh, Andrew McNutt and Sam Cohen.</p></div></div>


</div>
</div></div>
</body>
</html>